## Q1. List any five functions of the pandas library with execution.

In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [8]:
import pandas as pd


df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [9]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [11]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [14]:
list(df.columns)

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [20]:

def reindex_dataframe(df):
    # Create a new index starting from 1, incrementing by 2
    new_index = pd.RangeIndex(start=1, stop=2*len(df), step=2)

    # Set the new index to the DataFrame
    df_reindexed = df.set_index(new_index)

    return df_reindexed

# Example usage:
# Assuming df is your DataFrame with columns 'A', 'B', 'C'
df = pd.DataFrame({'A': [10, 20, 30], 'B': [40, 50, 60], 'C': [70, 80, 90]})

# Re-indexing the DataFrame
df_reindexed = reindex_dataframe(df)

# Displaying the re-indexed DataFrame
print (df_reindexed)

    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

## You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [25]:
df=pd.DataFrame({'values':[10, 20, 30, 40, 50]})
df1=df.head(3)
df1.sum()

values    60
dtype: int64

## Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [41]:
df2=pd.DataFrame({'Text':['soumyadeeproy','avijitroy','shiva','ram','saraswati']})
def add_word_count_column(df2):
    df2['word count']=df2['Text'].apply (lambda x: len(str(x)))

add_word_count_column(df2)  
print(df2)

            Text  word count
0  soumyadeeproy          13
1      avijitroy           9
2          shiva           5
3            ram           3
4      saraswati           9

## How are DataFrame.size() and DataFrame.shape() different?

the df.size gives the total number of elements present in the data frame but the df.shape give the structure of the data

In [53]:
df3=pd.DataFrame({'A':[10,20,30],'B':[40,50,60]})
size_result=df3.size
print('the size result is:',size_result)

the size result is: 6

In [56]:
df3=pd.DataFrame({'A':[10,20,30],'B':[40,50,60]})
shape_result=df3.shape
print('the shape result is:',shape_result)

the shape result is: (3, 2)

## Which function of pandas do we use to read an excel file?

In [57]:
# pd.read_excel("example exel data")

## You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column'Username' in df that contains only the username part of each email address.

In [64]:
df4=pd.DataFrame({'emails':['soumyadeeproy@gmail.com','roysam422@gmail.com','pandas@gmail.com',"avijit435@gmail.com"]})
def creating_username(df4):
    df4['Username']=df4['emails'].str.split('@').str[0]
creating_username(df4)
print(df4)

                    emails       Username
0  soumyadeeproy@gmail.com  soumyadeeproy
1      roysam422@gmail.com      roysam422
2         pandas@gmail.com         pandas
3      avijit435@gmail.com      avijit435

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
## all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
## function should return a new DataFrame that contains only the selected rows.
## For example, if df contains the following values:
## A B C
## 0 3 5 1
## 1 8 2 7
## 2 6 9 4
## 3 2 3 5
## 4 9 1 2
 ## Your function should select the following rows: A B C
## 1 8 2 7
## 4 9 1 2
## The function should return a new DataFrame that contains only the selected rows.

In [67]:
df5=pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})
def find_selected_values(df5):
    selected_rows = df5[(df5['A']>5) & (df5['B']<10)]
    return (selected_rows)
selected_values = find_selected_values(df5)
print(selected_values)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,median, and standard deviation of the values in the 'Values' column.

In [84]:
df6=pd.DataFrame({'Values':[2,5,4,9,6,3,4,7,6,8,2,89,6,8,1,9,2,9,3,8,2,8,2,9,2,9,2,9,4]})
df6.describe()

          Values
count  29.000000
mean    8.206897
std    15.796427
min     1.000000
25%     2.000000
50%     6.000000
75%     8.000000
max    89.000000

In [90]:
 df7 = pd.DataFrame({'Date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05'],
                   'Sales': [10, 12, 15, 20, 18]})


def calculate_moving_average(df7):
    # Convert 'Date' column to datetime type
    df7['Date'] = pd.to_datetime(df7['Date'])

    # Sort the DataFrame by 'Date'
    df7= df7.sort_values('Date')

    # Calculate the moving average with a window size of 7
    df7['MovingAverage'] = df7['Sales'].rolling(window=7, min_periods=1).mean()

# Example usage:
# Assuming df is your DataFrame with columns 'Sales' and 'Date'
# df = pd.DataFrame({'Date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05'],
#                    'Sales': [10, 12, 15, 20, 18]})

# Call the function with your DataFrame
calculate_moving_average(df7)

# Displaying the DataFrame with the new 'MovingAverage' column
print(df7)

        Date  Sales
0 2022-01-01     10
1 2022-01-02     12
2 2022-01-03     15
3 2022-01-04     20
4 2022-01-05     18

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
## column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
## Monday, Tuesday) corresponding to each date in the 'Date' column.
## For example, if df contains the following values:
## Date
## 0 2023-01-01
## 1 2023-01-02
## 2 2023-01-03
## 3 2023-01-04
## 4 2023-01-05
## Your function should create the following DataFrame:

## Date Weekday
## 0 2023-01-01 Sunday
## 1 2023-01-02 Monday
## 2 2023-01-03 Tuesday
## 3 2023-01-04 Wednesday
## 4 2023-01-05 Thursday
## The function should return the modified DataFrame.

In [93]:
df8=pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})


def add_weekday_column(df8):
    # Convert 'Date' column to datetime type
    df8['Date'] = pd.to_datetime(df8['Date'])

    # Create the 'Weekday' column with the weekday names
    df8['Weekday'] = df8['Date'].dt.strftime('%A')

# Example usage:
# Assuming df is your DataFrame with a 'Date' column
# df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})

# Call the function with your DataFrame
add_weekday_column(df8)

# Displaying the modified DataFrame with the new 'Weekday' column
print(df8)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [97]:
import pandas as pd
df9 = pd.DataFrame({'Date': ['2023-01-01', '2023-01-15', '2023-01-25', '2023-02-05'],
                    'Values': [10, 15, 20, 25]})
def select_rows_in_date_range(df9):
    # Convert 'Date' column to datetime type
    df9['Date'] = pd.to_datetime(df9['Date'])

    # Select rows where the date is between '2023-01-01' and '2023-01-31'
    selected_rows = df9[(df9['Date'] >= '2023-01-01') & (df9['Date'] <= '2023-01-31')]
    
    return selected_rows

# Example usage:
# Assuming df is your DataFrame with a 'Date' column


# Call the function with your DataFrame
selected_df = select_rows_in_date_range(df9)

print(selected_df)

        Date  Values
0 2023-01-01      10
1 2023-01-15      15
2 2023-01-25      20


## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [104]:
import pandas as pd